app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "postal_code", "password_digest", "recovery_password_digest", "is_parent", "is_caregiver", "description", "photo_url", "gender", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save